Repository: oandregal/poss-gl
Catalog: tmx/ch03.tmx
Source language: en
Languages: gl

source: The term <firstterm>bug tracker</firstterm> is misleading. Bug tracking systems are also frequently used to track new feature requests, one-time tasks, unsolicited patches&mdash;really anything that has distinct beginning and end states, with optional transition states in between, and that accrues information over its lifetime. For this reason, bug trackers are also called <firstterm>issue trackers</firstterm>, <firstterm>defect trackers</firstterm>, <firstterm>artifact trackers</firstterm>, <firstterm>request trackers</firstterm>, <firstterm>trouble ticket systems</firstterm>, etc. See <xref linkend="bug-trackers"/> for a list of software.
gl: O termo <firstterm>bug tracker</firstterm> é confuso. Os sistemas de xestión de erros son usados frecuentemente para facer seguimento de requirimentos de novas características, tarefas unitarias, remendos non solicitados&mdash;en realidade calquera cousa que presenta distintos estados de inicio e de fin, con estados opcionais de transición no medio, o que fai incrementar a información asociada ao longo do tempo. Por esta razón os xestores de erros son tamén denominados <firstterm>xestores de asuntos (issue trackers)</firstterm>, <firstterm>xestores de defectos (defect trackers)</firstterm>, <firstterm>xestores de artefactos (artifact trackers)</firstterm>, <firstterm>xestores de requisitos (request trackers)</firstterm>, <firstterm>sitemas de tickets de errores (trouble ticket systems)</firstterm>, etc. Podes consultar unha lista de software en<xref linkend="bug-trackers"/>.

source: In this book, I'll continue to use "bug tracker" for the software that does the tracking, because that's what most people call it, but will use <firstterm>issue</firstterm> to refer to a single item in the bug tracker's database. This allows us to distinguish between the behavior or misbehavior that the user encountered (that is, the bug itself), and the tracker's <emphasis>record</emphasis> of the bug's discovery, diagnosis, and eventual resolution. Keep in mind that although most issues are about actual bugs, issues can be used to track other kinds of tasks too.
gl: Neste libro, eu vou continuar a falar de "xestor de erros (bug tracker)" cando me refira ao software que fai o seguimento, xa que é así como a maioría da xente lle chama, mais vou empregar <firstterm>asunto (issue)</firstterm> para referirme a unha instancia individual na base de datos do xestor de erros. Isto vainos permitir distinguir entre o comportamento ou fallo que o usuario ten atopado (isto é, o error ou "bug" en sí mesmo), e os <emphasis>rexistros</emphasis> referidos ao descubrimento, diagnose e eventual resolución do erro. Ten en conta que aínda que moitos asuntos se refiren a erros reais, tamén poden referirse igualmente ao seguimento de outros tipos de tarefas.

source: The classic issue life cycle looks like this:
gl: O clásico ciclo de vida dun asunto é semellante a:

source: Someone files the issue. They provide a summary, an initial description (including a reproduction recipe, if applicable; see <xref linkend="users-to-volunteers"/><phrase output="printed"> in <xref linkend="managing-volunteers"/></phrase> for how to encourage good bug reports), and whatever other information the tracker asks for. The person who files the issue may be totally unknown to the project&mdash;bug reports and feature requests are as likely to come from the user community as from the developers.
gl: Alguén detecta o erro. Subministra un resumo, unha breve descrición do mesmo (incluíndo unha receita para reproducir o fallo, no seu caso; bótalle unha ollada a <xref linkend="de-usuarios-a-voluntarios"/><phrase output="printed"> en <xref linkend="xestionando-voluntarios"/></phrase> para entenderes como se debe pedir á xente que faga bos informes de erros), así como calquera outra información que o xestor de erros pida. A persoa que detecta o asunto pode ser totalmente descoñecida para o proxecto&mdash;os informes sobre erros e o requirimento de novas funcionalidades terán as mesmas probabilidades de seren solicitados tanto por usuarios como polos desenvolvedores.

source: Once filed, the issue is in what's called an <firstterm>open</firstterm> state. Because no action has been taken yet, some trackers also label it as <firstterm>unverified</firstterm> and/or <firstterm>unstarted</firstterm>. It is not assigned to anyone; or, in some systems, it is assigned to a fake user to represent the lack of real assignation. At this point, it is in a holding area: the issue has been recorded, but not yet integrated into the project's consciousness.
gl: Unha vez reportado, o asunto fica rexistrado no estado coñecido como <firstterm>aberto</firstterm>. Como de momento non se realizou ningunha operación sobre el, algúns xestores de erros o denominan <firstterm>non verificado</firstterm> e/ou <firstterm>sen iniciar</firstterm>. Non está aínda asignado a ninguén; ou, nalgúns xestores, se lle asigna a un usuario ficticio, o que vén a representar a ausencia de asignación. Neste punto, está nun espazo de espera: o asunto foi arquivado, mais aínda non está integrado na conciencia activa do proxecto.

source: Others read the issue, add comments to it, and perhaps ask the original filer for clarification on some points.
gl: Outra xente vai ler o asunto, engadirlle comentarios, e talvez preguntarlle ao remitente orixinal sobre detalles que clarifiquen algún punto escuro.

source: The bug gets <firstterm>reproduced</firstterm>. This may be the most important moment in its life cycle. Although the bug is not actually fixed yet, the fact that someone besides the original filer was able to make it happen proves that it is genuine, and, no less importantly, confirms to the original filer that they've contributed to the project by reporting a real bug.
gl: O erro é entón <firstterm>reproducido</firstterm>. Este pode ser o momento máis importante no seu ciclo de vida. Aínda que o erro non está corrixido, o feito de que alguén ademais do remitente orixinal sexa quen de reproducilo vai demostrar que é auténtico, e , non menos importante, vai confirmar a quen o detectou por primeira vez que contribuíu ao proxecto cun erro real.

source: The bug gets <firstterm>diagnosed</firstterm>: its cause is identified, and if possible, the effort required to fix it is estimated. Make sure these things get recorded in the issue; if the person who diagnosed the bug suddenly has to step away from the project for a while (as can often happen with volunteer developers), someone else should be able to pick up where she left off.
gl: O erro é entón <firstterm>diagnosticado</firstterm>: identifícase a causa que o produce, e se for posible, estímase o esforzo requerido para corrixilo. Estes procesos deben ficar gravados no sistema; se a persoa que fai o diagnóstico desaparece repentinamente do proxecto por un tempo (o que vai suceder frecuentemente cos desenvolvedores voluntarios), calquera outro deberá ser quen de retomar a xestión do erro onde o outro o deixou.

source: In this stage, or sometimes the previous one, a developer may "take ownership" of the issue and <firstterm>assign</firstterm> it to herself (<xref linkend="delegation-assignment"/><phrase output="printed"> in <xref linkend="managing-volunteers"/></phrase> examines the assignment process in more detail). The issue's <firstterm>priority</firstterm> may also be set at this stage. For example, if it is so severe that it should delay the next release, that fact needs to be identified early, and the tracker should have some way of noting it.
gl: Neste paso, ou ás veces no anterior, un desenvolvedor vaise "apropiar" do asunto e <firstterm>auto asignarseo</firstterm> (<xref linkend="asignación-de-delegacións"/><phrase output="printed"> en <xref linkend="xestionando-voluntarios"/></phrase> examina o proceso con máis detalle). A <firstterm>prioridade</firstterm> pode tamén ser establecida neste paso. Por exemplo, se for tan severo que podería retrasar a seguinte liberación, ese asunto precisa ser identificado logo, e o xestor debería proporcionar algunha maneira de notificalo.

source: The issue gets scheduled for resolution. Scheduling doesn't necessarily mean naming a date by which it will be fixed. Sometimes it just means deciding which future release (not necessarily the next one) the bug should be fixed by, or deciding that it need not block any particular release. Scheduling may also be dispensed with, if the bug is quick to fix.
gl: O asunto é entón programado para ser resolto. A programación non ten por que incluír a determinación dunha data límite para a súa corrección. Ás veces implica simplemente determinar en que liberación futura (non necesariamente a seguinte) o erro debería estar solucionado, ou decidir que non é preciso bloquear ningunha liberación en particular. A programación pode tamén ser ignorada, se o erro é doado de resolver.

source: The bug gets fixed (or the task completed, or the patch applied, or whatever). The change or set of changes that fixed it should be recorded in a comment in the issue, after which the issue is <firstterm>closed</firstterm> and/or marked as <firstterm>resolved</firstterm>.
gl: O erro é resolto (ou a tarefa completada, ou o remendo aplicado, ou o que for). A mudanza ou conxunto de mudanzas resultantes da súa resolución deberán ser gravadas nun comentario, e posteriormente o asunto é <firstterm>pechado</firstterm> e/ou marcado como <firstterm>resolto</firstterm>.

source: There are some common variations on this life cycle. Sometimes an issue is closed very soon after being filed, because it turns out not to be a bug at all, but rather a misunderstanding on the part of the user. As a project acquires more users, more and more such invalid issues will come in, and developers will close them with increasingly short-tempered responses. Try to guard against the latter tendency. It does no one any good, as the individual user in each case is not responsible for all the previous invalid issues; the statistical trend is visible only from the developers' point of view, not the user's. (In <xref linkend="bug-filtering"/><phrase output="printed"> later in this chapter,</phrase> we'll look at techniques for reducing the number of invalid issues.) Also, if different users are experiencing the same misunderstanding over and over, it might mean that that aspect of the software needs to be redesigned. This sort of pattern is easiest to notice when there is an issue manager monitoring the bug database; see <xref linkend="issue-manager"/><phrase output="printed"> in <xref linkend="managing-volunteers"/></phrase>.
gl: Hai algunhas variacións frecuentes sobre este ciclo de vida. Ás veces un asunto é pechado moi cedo tras ser comunicado, porque resulta non ser realmente un erro, senón un fallo de utilización por parte do usuario. Segundo o proxecto vai tendo máis usuarios, máis de estes falsos erros van ser comunicados, e os desenvolvedores van proceder a pechalos con comentarios cada vez máis intempestivos. Tenta evitar esta última tendencia. Non lle fai ningún ben a ninguén, xa que o usuario que comunica o erro en cada caso non é responsable do todas as comunicacións previas; a tendencia estatística é visible só desde o punto de vista dos desenvolvedores, non dos usuarios.(Máis adiante neste capítulo, en <xref linkend="filtrado-de-erros"/><phrase output="printed"> </phrase>, veremos algunhas técnicas destinadas a reducir o número de falsos erros). Igualmente, se diferentes usuarios están a cometer o mesmo fallo de operación unha e outra vez, poderíase pensar que esa parte do software precisa ser redeseñada. Este tipo de padróns son máis doados de detectar cando hai un xestor de asuntos monitorizando a base de datos de erros; véxase <xref linkend="xestor-de-asuntos"/><phrase output="printed"> en <xref linkend="xestionando-voluntarios"/></phrase>.

source: Another common life cycle variation is for the issue to be closed as a <firstterm>duplicate</firstterm> soon after Step 1. A duplicate is when someone files an issue that's already known to the project. Duplicates are not confined to open issues: it's possible for a bug to come back after having been fixed (this is known as a <firstterm>regression</firstterm>), in which case the preferred course is usually to reopen the original issue and close any new reports as duplicates of the original one. The bug tracking system should keep track of this relationship bidirectionally, so that reproduction information in the duplicates is available to the original issue, and vice versa.
gl: Outra variación frecuente do ciclo de vida consiste en pechar o asunto como <firstterm>duplicado</firstterm> xusto despois do Paso 1. Un duplicado é un asunto que xa é coñecido polos responsables do proxecto. Os duplicados non afectan exclusivamente a asuntos abertos: é posible que un erro volva manifestarse mesmo despois de ter sido resolto (isto é coñecido como <firstterm>regresión</firstterm>), en cuxo caso o procedemento preferido consiste en reabrir o asunto orixinal e pechar calquera nova notificación do mesmo como duplicados do anterior. O sistema de xestión de erros debería facer seguimento bidireccional desta relación, de xeito que a información sobre reproducción contida nos duplicados estea dispoñible para o orixinal, e viceversa.

source: A third variation is for the developers to close the issue, thinking they have fixed it, only to have the original reporter reject the fix and reopen it. This is usually because the developers simply don't have access to the environment necessary to reproduce the bug, or because they didn't test the fix using the exact same reproduction recipe as the reporter.
gl: Unha terceira variación consiste en que os desenvolvedores pechen o asunto, pensando que o resolveron, e ver que o informante orixinal rexeita a solución e o reabre. Isto xeralmente ocorre porque os desenvolvedores simplemente non teñen acceso ao entorno necesario para reproduciren o fallo, ou porque non o reproduciron seguindo exactamente a mesma receita aportada polo informante para a súa reprodución.

source: Aside from these variations, there may be other small details of the life cycle that vary depending on the tracking software. But the basic shape is the same, and while the life cycle itself is not specific to open source software, it has implications for how open source projects use their bug trackers.
gl: Para alén destas varacións, poden darse outros aspectos do xestor de erros que poden variar dependendo do software empregado. Mais o aspecto básico é o mesmo, e mentres o ciclo de vida en sí mesmo non é especifico do software de fontes abertas, ten implicacións concretas en como os proxectos de software aberto usan os seus xestores de erros.

source: As Step 1 implies, the tracker is as much a public face of the project as the mailing lists or web pages. Anyone may file an issue, anyone may look at an issue, and anyone may browse the list of currently open issues. It follows that you never know how many people are waiting to see progress on a given issue. While the size and skill of the development community constrains the rate at which issues can be resolved, the project should at least try to acknowledge each issue the moment it appears. Even if the issue lingers for a while, a response encourages the reporter to stay involved, because she feels that a human has registered what she has done (remember that filing an issue usually involves more effort than, say, posting an email). Furthermore, once an issue is seen by a developer, it enters the project's consciousness, in the sense that that developer can be on the lookout for other instances of the issue, can talk about it with other developers, etc.
gl: Tal como se deduce do Paso 1, o xestor é tan "fachada pública" do proxecto como poidan selo as listas de correo ou as páxinas web. Calquera pode rexistrar un asunto, calquera pode facer seguimento dun asunto, e calquera pode explorar a lista de asuntos actualmente abertos. Ocorre que non podes coñecer canta xente está pendente de como se resolve un asunto. Mentres que o tamaño e a habilidade da comunidade van reducir o prazo en que os asuntos son resoltos, o proxecto debería en todo caso ser quen de tomar coñecemento de cada asunto xusto no momento en que é detectado. Mesmo se un asunto permanece activo durante un tempo, unha resposta vai favorecer que o informante permaneza interesado, xa que vai notar que alguén tomou nota do que el reportou (lembra que preencher un formulario de notificación dun asunto leva máis tempo que, por exemplo, escribir un correo electrónico). Aínda máis, unha vez que un asunto é revisado por un desenvolvedor, pasa a formar parta da "consciencia" do proxecto, no senso de que ese desenvolvedor pode estar xa analizando outras instancias do asunto, pode falar sobre o tema con outros colegas, etc.

source: The need for timely reactions implies two things:
gl: A necesidade de reaccionar a tempo implica dúas cousas:

source: The tracker must be connected to a mailing list, such that every change to an issue, including its initial filing, causes a mail to go out describing what happened. This mailing list is usually different from the regular development list, since not all developers may want to receive automated bug mails, but (just as with commit mails) the Reply-to header should be set to the development mailing list.
gl: O xestor debe estar conectado a unha lista de correo, de xeito que cada mudanza sobre un asunto, incluíndo a súa notificación inicial, debe producir unha mensaxe de correo que describa o que aconteceu. Esta lista de correo é xeralmente distinta da de desenvolvemento, xa que non todos os desenvolvedores poden querer recibir mensaxes automatizadas referidas a erros, mais (igual que nas mensaxes de inserción de cambios) o cabezallo "Reply-to" debería ser dirixido á lista xeral de desenvolvemento.

source: The form for filing issues should capture the reporter's email address, so she can be contacted for more information. (However, it should not <emphasis>require</emphasis> the reporter's email address, as some people prefer to report issues anonymously. See <xref linkend="anonymity"/><phrase output="printed"> later in this chapter</phrase> for more on the importance of anonymity.)
gl: O formulario de notificación de asuntos debería capturar o enderezo de correo do remitente, de xeito que poida ser contactado para pedirlle máis información. (Porén, non debería <emphasis>requerir</emphasis> ese enderezo, dado que hai xente que prefire notificar erros de xeito anónimo. Véxase <xref linkend="confidencialidade"/><phrase output="printed"> máis adiante neste capítulo</phrase> para ler información adicional sobre a importancia de poder manter o anonimato.)

source: Interaction with Mailing Lists
gl: Interacción con listas de correo

source: Make sure the bug tracker doesn't turn into a discussion forum. Although it is important to maintain a human presence in the bug tracker, it is not fundamentally suited to real-time discussion. Think of it rather as an archiver, a way to organize facts and references to other discussions, primarily those that take place on mailing lists.
gl: Asegúrate de que o xestor de erros non se convirte nun foro de discusión. Aínda que é importante manter a presencia humana no sistema, non está preparado para soportar discusións en tempo real. Máis ben debes pensar nel como un arquivador, un xeito de organizar feitos e referencias cara a outras discusións, basicamente aquelas que teñen lugar nas listas de correo.

source: There are two reasons to make this distinction. First, the bug tracker is more cumbersome to use than the mailing lists (or than real-time chat forums, for that matter). This is not because bug trackers have bad user interface design, it's just that their interfaces were designed for capturing and presenting discrete states, not free-flowing discussions. Second, not everyone who should be involved in discussing a given issue is necessarily watching the bug tracker. Part of good issue management (see <xref linkend="share-management"/><phrase output="printed"> in <xref linkend="managing-volunteers"/></phrase>) is to make sure each issue is brought to the right peoples' attention, rather than requiring every developer to monitor all issues. In <xref linkend="bug-tracker-usage"/><phrase output="printed"> in <xref linkend="communications"/>,</phrase> we'll look at ways to make sure people don't accidentally siphon discussions out of appropriate forums and into the bug tracker.
gl: Hai dúas razóns para facer esta distinción. Primeiro, o xestor de erros e máis complicado de usar que as listas de correo (ou que os chats en tempo real). Isto non é así debido a que o xestor teña unha interface de usuario mal deseñada, senón a que as súas interfaces foron deseñadas para capturar e presentar estados discretos, non discusións libres. En segundo lugar, non todo o mundo que está a seguir unha determinada discusión sobre un asunto ten por que estar conectado ao xestor de erros. En parte a boa xestión de asuntos (véxase <xref linkend="xestión-compartida"/><phrase output="printed"> en <xref linkend="xestionando-voluntarios"/></phrase>) ten a ver con asegurar que a información correcta está sendo posta a disposición da xente axeitada, máis que con pretender que todos os desenvolvedores estean pendentes de todos os asuntos. En <xref linkend="uso-do-xestor-de-erros"/><phrase output="printed"> en <xref linkend="comunicacións"/>,</phrase> veremos algunhas maneiras de asegurar que a xente non lance discusións fora dos foros apropiados e no xestor de erros.

source: Some bug trackers can monitor mailing lists and automatically log all emails that are about a known issue. Typically they do this by recognizing the issue's identifying number in the subject line of the mail, as part of a special string; developers learn to include these strings in their mails to attract the tracker's notice. The bug tracker may either save the entire email, or (even better) just record a link to the mail in the regular mailing list archive. Either way, this is a very useful feature; if your tracker has it, make sure both to turn it on and to remind people to take advantage of it.
gl: Algúns xestores de erros poden monitorizar as listas de correo e rexistrar automaticamente todas as mensaxes que teñen a ver cun asunto coñecido. Tipicamente fan isto mediante o recoñecemento do identificador do erro na liña de "asunto" das mensaxes para atraeren a atención do xestor. Este ou ben gardará toda a mensaxe, ou (aínda mellor) gravará unha ligazón á mensaxe gardada nos arquivos da lista de correo. En calquera caso, esta é unha característica moi útil; se o teu xestor dispón dela, asegúrate de activala e de recomendar á xente a súa utilización.

source: Pre-Filtering the Bug Tracker
gl: Pre-filtrando o xestor de erros
